app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def welcome
      #code
      @pictures = Picture.all

INSERT INTO "pictures" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["url", ""], ["created_at", 2016-11-07 17:02:23 UTC], ["updated_at", 2016-11-07 17:02:23 UTC]]
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

UPDATE "pictures" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["title", "Tiger"], ["url", "http://freepngimages.com/wp-content/uploads/2015/10/tiger-jumping-transparent-png-image.png"], ["updated_at", 2016-11-08 00:35:18 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @picture.update(picture_params)

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 6]]
---
  def destroy
    @picture.destroy